node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\237\223@\000\000\000\000\000\220\223@\232\231\231\231\231u\223@33333\270\223@fffff\256\223@fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000\220\223@\232\231\231\231\231u\223@33333\270\223@fffff\256\223@fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@"
      }
    }
  }
}
node {
  name: "tensors/component_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@"
      }
    }
  }
}
node {
  name: "tensors/component_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@"
      }
    }
  }
}
node {
  name: "tensors/component_7"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@"
      }
    }
  }
}
node {
  name: "tensors/component_8"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@"
      }
    }
  }
}
node {
  name: "tensors/component_9"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@"
      }
    }
  }
}
node {
  name: "tensors/component_10"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@"
      }
    }
  }
}
node {
  name: "tensors/component_11"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@"
      }
    }
  }
}
node {
  name: "tensors/component_12"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231u\223@33333\270\223@fffff\256\223@fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@"
      }
    }
  }
}
node {
  name: "tensors/component_13"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@"
      }
    }
  }
}
node {
  name: "tensors/component_14"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@"
      }
    }
  }
}
node {
  name: "tensors/component_15"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@"
      }
    }
  }
}
node {
  name: "tensors/component_16"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@"
      }
    }
  }
}
node {
  name: "tensors/component_17"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\034\224@\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@"
      }
    }
  }
}
node {
  name: "tensors/component_18"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\255\224@fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@\033\233f]\344\376\224@"
      }
    }
  }
}
node {
  name: "tensors/component_19"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffffz\224@33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@\033\233f]\344\376\224@\307\241\247\026\2444\225@"
      }
    }
  }
}
node {
  name: "tensors/component_20"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333g\224@\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@\033\233f]\344\376\224@\307\241\247\026\2444\225@\307\241\247\026\2444\225@"
      }
    }
  }
}
node {
  name: "tensors/component_21"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\231\224@\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@\033\233f]\344\376\224@\307\241\247\026\2444\225@\307\241\247\026\2444\225@\307\241\247\026\2444\225@"
      }
    }
  }
}
node {
  name: "tensors/component_22"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\231\224@\344\245\233\304 0\224@y\356=\\r\374\223@\361s2\'\036\226\223@)%P90\257\223@)%P90\257\223@)%P90\257\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\340\004_\0053\257\224@IT/\273&\344\224@\033\233f]\344\376\224@\307\241\247\026\2444\225@\307\241\247\026\2444\225@\307\241\247\026\2444\225@M\243)]\346\274\225@"
      }
    }
  }
}
node {
  name: "tensors/component_23"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\270\223@fffff\256\223@fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@"
      }
    }
  }
}
node {
  name: "tensors/component_24"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\256\223@fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@"
      }
    }
  }
}
node {
  name: "tensors/component_25"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "fffff\311\223@33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@"
      }
    }
  }
}
node {
  name: "tensors/component_26"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\314\223@\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@"
      }
    }
  }
}
node {
  name: "tensors/component_27"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\232\231\231\231\231\312\223@33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@"
      }
    }
  }
}
node {
  name: "tensors/component_28"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\267\223@33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@"
      }
    }
  }
}
node {
  name: "tensors/component_29"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "33333\325\223@33333\246\223@\315\314\314\314\314\265\223@\315\314\314\314\314\317\223@\232\231\231\231\231\373\223@33333!\224@fffff\004\224@fffff\352\223@\232\231\231\231\231\330\223@\232\231\231\231\231\027\224@\000\000\000\000\000=\224@fffff\036\224@fffff\024\224@\315\314\314\314\314\031\224@\232\231\231\231\231\027\224@33333\034\224@\232\231\231\231\231\255\224@fffffz\224@"
      }
    }
  }
}
node {
  name: "tensors/component_30"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_31"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000j\370@\'\367;\024\005<\365@\026\256\375S`\206\365@\252_V\031\247p\362@\330\374T\313\206\221\362@\330\374T\313\206\221\362@\330\374T\313\206\221\362@\244\340(<\366\317\356@\244\340(<\366\317\356@\200\254\3204\"\016\347@\200\254\3204\"\016\347@ \347\256U%\212\340@\300\362(\324\364\352\323@\3469\241\364\030\303\272@\346\342L\350\023\255\272\300\346\342L\350\023\255\272\300\346\342L\350\023\255\272\300\013/\264\310Tu\330\300"
      }
    }
  }
}
node {
  name: "tensors/component_32"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\344\245\233\304 0\224@\344\245\233\304 0\224@\361s2\'\036\226\223@\361s2\'\036\226\223@\361s2\'\036\226\223@\361s2\'\036\226\223@\311\240L\336\370\023\224@\311\240L\336\370\023\224@4\327\225\206\305z\224@4\327\225\206\305z\224@\nn\372E\374\224\224@tea\302_\257\224@\336\262\"\351@\303\224@s\257\243X\356\331\224@s\257\243X\356\331\224@s\257\243X\356\331\224@;\331\260\023%\373\224@"
      }
    }
  }
}
node {
  name: "tensors/component_33"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_34"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: " \307q\034\307q\254? \307q\034\307q\274?XUUUUU\305? \307q\034\307q\314?r\034\307q\034\307\321?VUUUUU\325?:\216\3438\216\343\330?\034\307q\034\307q\334?\000\000\000\000\000\000\340?r\034\307q\034\307\341?\3448\216\3438\216\343?VUUUUU\345?\307q\034\307q\034\347?9\216\3438\216\343\350?\253\252\252\252\252\252\352?\034\307q\034\307q\354?\216\3438\216\3438\356?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_35"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\000\000\000\000\000j\370@\023I\3642\212c\370@\002\000\266r\345\255\370@\264\223.\356\240\247\370@\3420-\240\200\310\370@\3420-\240\200\310\370@\3420-\240\200\310\370@{\235\250\325\023\302\370@{\235\250\325\023\302\370@\010\355\003\257X\024\370@\010\355\003\257X\024\370@\033\343I8\272\r\370@f\021\274\317\n\007\370@\221\360\223\330R\000\370@\013@O\256\211\371\367@\013@O\256\211\371\367@\013@O\256\211\371\367@\014\355\334G6\350\366@"
      }
    }
  }
}
node {
  name: "tensors/component_36"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 18
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 18
          }
        }
        tensor_content: "\004\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\t\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1000
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "Iterator"
  op: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "tensors/component_0"
  input: "tensors/component_1"
  input: "tensors/component_2"
  input: "tensors/component_3"
  input: "tensors/component_4"
  input: "tensors/component_5"
  input: "tensors/component_6"
  input: "tensors/component_7"
  input: "tensors/component_8"
  input: "tensors/component_9"
  input: "tensors/component_10"
  input: "tensors/component_11"
  input: "tensors/component_12"
  input: "tensors/component_13"
  input: "tensors/component_14"
  input: "tensors/component_15"
  input: "tensors/component_16"
  input: "tensors/component_17"
  input: "tensors/component_18"
  input: "tensors/component_19"
  input: "tensors/component_20"
  input: "tensors/component_21"
  input: "tensors/component_22"
  input: "tensors/component_23"
  input: "tensors/component_24"
  input: "tensors/component_25"
  input: "tensors/component_26"
  input: "tensors/component_27"
  input: "tensors/component_28"
  input: "tensors/component_29"
  input: "tensors/component_30"
  input: "tensors/component_31"
  input: "tensors/component_32"
  input: "tensors/component_33"
  input: "tensors/component_34"
  input: "tensors/component_35"
  input: "tensors/component_36"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ShuffleDataset"
  op: "ShuffleDataset"
  input: "TensorSliceDataset"
  input: "buffer_size"
  input: "seed"
  input: "seed2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
